Idan707/chiki/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
# board PSRAM is OCTAL despite AP_3v3 efuse vendor - quad hangs silently pre-console
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LV_FONT_UNSCII_16=y
CONFIG_LV_FONT_DEJAVU_16_PERSIAN_HEBREW=y
CONFIG_LV_USE_BIDI=y
CONFIG_LV_BIDI_DIR_AUTO=y

# TLS buffers in PSRAM - internal DMA heap must stay free for display SPI bounce buffers
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
